Revit 2027 API
RebarCoverType.CoverDistance Property
 A distance that can be used as a concrete cover value in a document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CoverDistance { get; set; }
Public Property CoverDistance As Double
	Get
	Set
public:
property double CoverDistance {
	double get ();
	void set (double value);
}
member CoverDistance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: coverDistance cannot be negative.
See Also
Reference
RebarCoverType Class
Autodesk.Revit.DB.Structure Namespace